Repository: jmo3300/py01_i18n_01
Catalog: locale/*/LC_MESSAGES/argparse.po
Languages: de

source: usage:
de: Starten mit:

source: .__call__() not defined
de: .__call__() nicht definiert

source: unknown parser %(parser_name)r (choices: %(choices)s)
de: Unbekannter Parser %(parser_name)r (Auswahl: %(choices)s)

source: argument "-" with mode %r
de: Argument "-" mit Modus %r

source: can't open '%s': %s
de: '%s' kann nicht geöffnet werden: %s

source: cannot merge actions - two groups are named %r
de: Aktionen können nicht zusammengeführt werden - zwei Gruppen heißen %r

source: 'required' is an invalid argument for positionals
de: "erforderlich" ist ein ungültiges Argument für Positionen

source: invalid option string %(option)r: must start with a character %(prefix_chars)r
de: Ungültige Option %(option)r: muss mit einem Zeichen %(prefix_chars)r beginnen

source: dest= is required for options like %r
de: dest= ist für Optionen wie %r erforderlich

source: invalid conflict_resolution value: %r
de: Ungültiger conflict_resolution-Wert: %r

source: mutually exclusive arguments must be optional
de: sich gegenseitig ausschließende Argumente müssen optional sein

source: positional arguments
de: Positionsargumente

source: optional arguments
de: optionale Argumente

source: show this help message and exit
de: zeige diese Hilfe-Nachricht an und beende das Programm

source: cannot have multiple subparser arguments
de: mehrere subparser Argumente sind nicht zulässig

source: unrecognized arguments: %s
de: unberücksichtigte Argumente: %s

source: not allowed with argument %s
de: Mit Argument %s nicht zulässig

source: ignored explicit argument %r
de: explizites Argument %r nicht berücksichtigt

source: the following arguments are required: %s
de: Folgende Argumente sind notwendig: %s

source: one of the arguments %s is required
de: Eines der der Argumente %s sind notwendig

source: expected one argument
de: ein Argument ist erwartet

source: expected at most one argument
de: höchstens ein Argument ist erwartet

source: expected at least one argument
de: mindestens ein Argument ist erwartet

source: ambiguous option: %(option)s could match %(matches)s
de: mehrdeutige Option: %(option)s könnte übereinstimmen mit %(matches)s

source: unexpected option string: %s
de: unerwartetes Optionsliteral: %s

source: %r is not callable
de: %r ist nicht ausführbar

source: invalid %(type)s value: %(value)r
de: unzulässiger %(type)s Wert: %(value)r

source: invalid choice: %(value)r (choose from %(choices)s)
de: ungültige Auswahl: %(value)r (gültig sind %(choices)s)

source: %(prog)s: error: %(message)s
de: %(prog)s: Fehler: %(message)s
